[{"entities": {"1 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.287219"}, "finance system": {"sent.score": "-0.541329", "type": "FieldTerminology", "sent": "negative", "rel": "0.287219"}, "America": {"sent.score": "-0.0742718", "type": "Continent", "sent": "negative", "rel": "0.827732"}, "Rachel": {"sent.score": "0.391608", "type": "Person", "sent": "positive", "rel": "0.368789"}, "Citizens United": {"sent.score": "-0.458312", "type": "Organization", "sent": "negative", "rel": "0.341293"}}, "id": "sanders", "text_speach": " Rachel, thank you very much.\n Millions of Americans are giving up on the political process. And they're giving up on the political process because they understand the economy is rigged.\n They are working longer hours for low wages. They're worried about the future of their kids, and yet almost all new income and wealth is going to the top 1 percent. Not what America is supposed to be about. Not the fairness that we grew up believing that America was about. And then sustaining that rigged economy is a corrupt campaign finance system undermining American democracy, where billionaire, Wall Street, corporate America can contribute unlimited sums of money into super PACs and into candidates.\n Our job, together, is to end a rigged economy, create an economy that works for all, and absolutely overturn Citizens United. One person, one vote. That's what American democracy is about.\n"}, {"entities": {"New Hampshire": {"sent.score": "0.601749", "type": "StateOrCounty", "sent": "positive", "rel": "0.97574"}}, "id": "hillary", "text_speach": " Well, I'm happy to be here in New Hampshire for this debate, as we move toward the primary on Tuesday.\n But there's also the continuing challenges of racism, of sexism, of discrimination against the LGBT community, of the way that we treat people as opposed to how we want to be treated.\n I believe that we can get back on the right track. I want to imagine a country where people's wages reflect their hard work, where we have healthcare for everyone, and where every child gets to live up to his or her potential.\n I'm fighting for people who cannot wait for those changes, and I'm not making promises that I cannot keep.\n"}, {"entities": {"Donald Trump": {"sent.score": "-0.25017", "type": "Person", "sent": "negative", "rel": "0.426251"}, "clean energy": {"sent.score": "0.64415", "type": "FieldTerminology", "sent": "positive", "rel": "0.547774"}, "Senator Sanders": {"sent.score": "0.479858", "type": "Person", "sent": "positive", "rel": "0.799479"}}, "id": "hillary", "text_speach": " Well, let me start by saying that Senator Sanders and I share some very big progressive goals. I've been fighting for universal healthcare for many years, and we're now on the path to achieving it. I don't want us to start over again. I think that would be a great mistake, to once again plunge our country into a contentious debate about whether we should have and what kind of system we should have for healthcare.\n I also believe in affordable college, but I don't believe in free college, because every expert that I have talked to says, look, how will you ever control the costs. What I want to do is make sure middle class kids, not Donald Trump's kids, get to be able to afford college. I want to get the economy going again. It's not just enough about what we're against, as important as that is. I have a plan to create new jobs, manufacturing, infrastructure, clean energy jobs that will make us the 21st century clean energy super power. I also want to make sure small businesses can start and grow again.\n And of course, I believe in raising the minimum wage and equal pay for work. But the numbers just don't add up, from what Senator Sanders has been proposing. That's why all of the independent experts, all of the editorial boards that have vetted both of us have concluded that it is just not achievable.\n Let's go down a path where we can actually tell people what we will do. A progressive is someone who makes progress. That's what I intend to do.\n"}, {"entities": {"president": {"sent.score": "-0.409917", "type": "JobTitle", "sent": "negative", "rel": "0.33"}}, "id": "sanders", "text_speach": " Well, I haven't quite run for president before.\n"}, {"entities": {"Senator Sanders": {"sent.score": "-0.556027", "type": "Person", "sent": "negative", "rel": "0.853742"}, "President Obama": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.753238"}}, "id": "hillary", "text_speach": " If I could just follow up on that.(APPLAUSE)\n The Republicans want to repeal the Affordable Care Act, I want to improve it. I want to build on it, get the costs down, get prescription drug costs down. Senator Sanders wants us to start all over again. This was a major achievement of President Obama, of our country. It is helping people right now.\n I am not going to wait and have us plunge back into a contentious national debate that has very little chance of succeeding. Let's make the Affordable Care Act work for everybody.\n"}, {"entities": {}, "id": "sanders", "text_speach": " Let me...\n"}, {"entities": {}, "id": "sanders", "text_speach": " ... this is a good discussion here.\n"}, {"entities": {"Secretary Clinton": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.898018"}, "Health Education Labor Committee": {"sent.score": "0.529062", "type": "Organization", "sent": "positive", "rel": "0.959614"}, "health insurance": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.466348"}, "Medicare": {"sent.score": "-0.431806", "type": "Organization", "sent": "negative", "rel": "0.304907"}, "America": {"sent.score": "-0.431806", "type": "Continent", "sent": "negative", "rel": "0.27849"}, "Secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.457496"}}, "id": "sanders", "text_speach": " And let me just say this. As Secretary Clinton may know, I am on the Health Education Labor Committee. That committee wrote the Affordable Care Act. The idea I would dismantle health care in America while we're waiting to pass a Medicare for all is just not accurate. The Affordable Care Act has clearly, as Secretary Clinton made the point, done a lot of good things, but, what it has not done is dealt with the fact we have 29 million people today who have zero health insurance, we have even more who are underinsured with large deductibles and copayments and prescription drug prices are off the wall.\n So I do believe that in the future, not by dismantling what we have here — I helped write that bill — but by moving forward, rallying the American people, I do believe we should have health care for all.\n"}, {"entities": {"Senator Shaheen": {"sent.score": "-0.233481", "type": "Person", "sent": "negative", "rel": "0.746104"}, "President Obama": {"sent.score": "-0.271607", "type": "Person", "sent": "negative", "rel": "0.5189"}, "Senator Paul Wellstone": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.891058"}, "Senator Sanders": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.613076"}, "Biden": {"sent.score": "-0.265162", "type": "Person", "sent": "negative", "rel": "0.352838"}, "Democratic Party": {"sent.score": "-0.467334", "type": "Organization", "sent": "negative", "rel": "0.328351"}, "Keystone": {"sent.score": "-0.265162", "type": "StateOrCounty", "sent": "negative", "rel": "0.253655"}, "Vice President": {"sent.score": "-0.265162", "type": "JobTitle", "sent": "negative", "rel": "0.394435"}}, "id": "hillary", "text_speach": " Well because I am a progressive who gets things done. And the root of that word, progressive, is progress. But I've heard Senator Sanders comments, and it's really caused me to wonder who's left in the progressive wing of the Democratic Party. Under his definition, President Obama is not progressive because he took donations from Wall Street; Vice President Biden is not progressive because she supported Keystone; Senator Shaheen is not progressive because she supports the trade pact. Even the late, great Senator Paul Wellstone would not fit this definition because he voted for DOMA.\n"}, {"entities": {"SANDERS": {"sent.score": "-0.273907", "type": "Person", "sent": "negative", "rel": "0.709383"}, "1 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.532256"}, "Congress": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.585735"}, "finance system": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.557517"}, "Cayman Islands": {"sent.score": "-0.210897", "type": "GeographicFeature", "sent": "negative", "rel": "0.634508"}, "United States": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.574174"}, "30 years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.532256"}, "America": {"sent.score": "0.38888", "type": "Continent", "sent": "positive", "rel": "0.532256"}}, "id": "sanders", "text_speach": " No, not at all. Here's the reality of American economic life today. The reality is that we have one of lowest voter turnouts of any major country on earth because so many people have given up on the political process. The reality is that there has been trillions of dollars of wealth going from the middle class in the last 30 years to the top 1/10th of 1 percent.\n The reality is we that have a corrupt campaign finance system which separates the American people's needs and desires from what Congress is doing. So to my mind, what we have got to do is wage a political revolution where millions of people have given up on the political process, stand up and fight back, demand the government that represents us and not just a handful of campaign contribution — contributors. SANDERS: Now all of the ideas that I'm talking about, they are not radical ideas. Making public colleges and universities tuition free, that exists in countries all over the world, used to exist in the United States. Rebuilding our crumbling infrastructure, and creating 13 million jobs by doing away with tax loopholes that large corporations now enjoy by putting their money into the Cayman Islands and other tax havens. That is not a radical idea.\n What we need to do is to stand up to the big money interests, and the campaign contributors. When we do that, we can, in fact, transform America.\n"}, {"entities": {"seven years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.167511"}, "President Obama": {"sent.score": "0.236327", "type": "Person", "sent": "positive", "rel": "0.852356"}, "Vice President Biden": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.407294"}, "Senate": {"sent.score": "0.5156", "type": "Organization", "sent": "positive", "rel": "0.241894"}, "$1.4 trillion": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.167511"}, "financial system": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.212382"}, "Ohio": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.239824"}, "President": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.354965"}, "the House": {"sent.score": "0.5156", "type": "FieldTerminology", "sent": "positive", "rel": "0.167511"}, "1.4 trillion dollar": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.167511"}, "Secretary": {"sent.score": "-0.448318", "type": "JobTitle", "sent": "negative", "rel": "0.275901"}}, "id": "sanders", "text_speach": " Let me just pick up on this point. This whole discussion began because I commented, not making overall evaluation about the Secretary. She was in Ohio, I think, in September or November and she got up and said something like, I have been — I'm paraphrasing, I have been criticized because people think I'm a moderate. Well, I am a moderate.\n That's where this came from. It wasn't me paraphrasing her. It is what she said, and all that I said was there's nothing wrong with being a moderate. But, you can't be a moderate, you can't a progressive.\n In terms of President Obama, I think if we remember where this country was seven years ago, 800,000 jobs being lost every month, $1.4 trillion dollar deficit. The world's financial system on the verge of collapse. I think that President Obama, Vice President Biden, and the Democratic leadership in the House and the Senate have done a fantastic job. We are in much better shape than we were seven years ago, although my Republican colleagues seem to have forgotten where we were seven years ago. That's the fact, but, we still have a very long way to go.\n Do I think President Obama is a progressive? Yes, I do. I disagree with him on a number of issues including the trade agreement. But, yes, I think he has done an excellent job.\n"}, {"entities": {"Children's Defense Fund": {"sent.score": "-0.524222", "type": "Organization", "sent": "negative", "rel": "0.92954"}}, "id": "hillary", "text_speach": " ... If I could, you know, in the very first debate I was asked am I a moderate or a progressive and I said I'm a progressive who likes to get things done. Cherry picking a quote here or there doesn't change my record of having fought for racial justice, having fought for kids rights, having fought the kind of inequities that fueled my interest in service in the first place going back to my days in the Children's Defense Fund.\n So, again...\n"}, {"entities": {"President": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.377825"}, "Senator Sanders": {"sent.score": "-0.262164", "type": "Person", "sent": "negative", "rel": "0.875237"}, "Commander in Chief": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.621871"}}, "id": "hillary", "text_speach": " ... I think it's important that, look, I understand Senator Sanders really trying to distinguish himself. I understand that, that's what you do in campaigns, but at the same time let's not be — in, I think an unfair way, making an accusation, or making an attack about where I stand and about where I've always stood.\n And, that's what we ought to be celebrating. Let's talk about what we would do as President, and Commander in Chief to make sure the progress continues into the future.\n"}, {"entities": {}, "id": "sanders", "text_speach": " That's right, I mean, instead of arguing about definitions, let's talk about...\n"}, {"entities": {}, "id": "sanders", "text_speach": " ... What we should do, and one of the things we should do is not only talk the talk, but walk the walk. I am very proud to be the only candidate up here who does not have a Super PAC, who's not raising huge sums of money from Wall Street...\n"}, {"entities": {"27 dollars": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.01"}, "$27": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.01"}}, "id": "sanders", "text_speach": " ... And special interests. I am enormously proud. Never believed it would happen that we have raised 3.5 million individual contributions, averaging $27 dollars a piece. That is what the political revolution means.(APPLAUSE)\n"}, {"entities": {"Rachel": {"sent.score": "0.256676", "type": "Person", "sent": "positive", "rel": "0.909231"}}, "id": "sanders", "text_speach": " Well, Rachel, actually, that wasn't accurate. In 1988 the Republican did win, I believe, by 3 points. I came in second. It was 34-31, I think, 19 for the Democrat. In that race the Democrat was the spoiler, not me. And it is true...\n"}, {"entities": {"nine years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.24087"}, "Vermont": {"sent.score": "0.290153", "type": "StateOrCounty", "sent": "positive", "rel": "0.308283"}, "Senate": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.290487"}, "Democratic Party": {"sent.score": "-0.415048", "type": "Organization", "sent": "negative", "rel": "0.795535"}, "frank": {"sent.score": "0.208705", "type": "Person", "sent": "positive", "rel": "0.24087"}, "Washington": {"sent.score": "0.290153", "type": "City", "sent": "positive", "rel": "0.279243"}, "three years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.24087"}, "the House": {"sent.score": "-0.355251", "type": "FieldTerminology", "sent": "negative", "rel": "0.251916"}, "United States Congress": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.393549"}, "Budget Committee": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.33756"}, "Veterans Committee": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.336659"}, "president": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.252349"}, "16 years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.24087"}}, "id": "sanders", "text_speach": " It is true, it's not to be denied, I am the longest- serving independent in the history of the United States Congress. People of Vermont sent me to Washington as an independent. That is true.\n But on the other hand, I have — when I was in the House for 16 years, I caucused with the Democrats. In the Senate for nine years caucused with the Democrats, of course. And I was elected by the Democrats to be chair of the Veterans Committee three years ago, which I'm very proud of. And now am the rankings member on the Budget Committee, leader of the Democrats in opposition to the majority Republicans.\n I am running for president as a Democrat. And if elected, not only do I hope to bring forth a major change in national priorities, but let me be frank, I do want to see major changes in the Democratic Party.\n I want to see working people and young people come into the party in a way that doesn't exist now. And you know what, I want a 50-state strategy so the Democratic Party is not just the party of 25 states.\n"}, {"entities": {"White House": {"sent.score": 0, "type": "Facility", "sent": "neutral", "rel": "0.46385"}, "president": {"sent.score": "0.410558", "type": "JobTitle", "sent": "positive", "rel": "0.439433"}, "CLINTON": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.489581"}, "Governor Howard Dean": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.991208"}, "partner": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.429236"}, "senator": {"sent.score": "-0.319757", "type": "JobTitle", "sent": "negative", "rel": "0.496989"}}, "id": "hillary", "text_speach": " You know, the person who first put out the idea of a 50-state party strategy is former Governor Howard Dean, who is with us tonight.\n CLINTON: And I'm very proud and grateful to have the support of so many elected Vermonters and former officials. Two former governors, the current governor, the current other senator. I really appreciate that.\n And I think it's because they've worked with me, they've seen what I do. They know what kind of a colleague I am. They want me as their partner in the White House. And that's exactly what I will do.\n We'll get things done together. Democrats, Republicans, independents, we're going to make progress together when I'm president.\n"}, {"entities": {}, "id": "sanders", "text_speach": " Well, I don't see it quite like that.\n"}, {"entities": {"Secretary Clinton": {"sent.score": "0.580021", "type": "Person", "sent": "positive", "rel": "0.86847"}, "Raul Grijalva": {"sent.score": "0.381367", "type": "Person", "sent": "positive", "rel": "0.453706"}, "House Progressive Caucus": {"sent.score": "0.381367", "type": "Organization", "sent": "positive", "rel": "0.547552"}, "Rachel": {"sent.score": "0.381367", "type": "Person", "sent": "positive", "rel": "0.306266"}, "the House": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.605623"}, "Keith Ellison": {"sent.score": "0.237442", "type": "Person", "sent": "positive", "rel": "0.389856"}, "Secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.469301"}}, "id": "sanders", "text_speach": " I am — will absolutely admit that Secretary Clinton has the support of far more governors, mayors, members of the House. She has the entire establishment or almost the entire establishment behind her. That's a fact. I don't deny it.\n But I am pretty proud that we have over a million people who have contributed to our campaign averaging 27 bucks apiece. That we have had meetings where 25,000-30,000 people have come out. That our campaign is a campaign of the people, by the people, and for the people.\n So, Rachel, yes, Secretary Clinton does represent the establishment. I represent, I hope, ordinary Americans, and by the way, who are not all that enamored with the establishment, but I am very proud to have people like Keith Ellison and Raul Grijalva in the House, the co-chairmen of the House Progressive Caucus.\n"}, {"entities": {"president": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.207324"}, "Senator Sanders": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.941134"}}, "id": "hillary", "text_speach": " Well, look, I've got to just jump in here because, honestly, Senator Sanders is the only person who I think would characterize me, a woman running to be the first woman president, as exemplifying the establishment. And I've got to tell you that it is... (APPLAUSE)\n People support me because they know me. They know my life's work. They have worked with me and many have also worked with Senator Sanders. And at the end of the day they endorse me because they know I can get things done.\n"}, {"entities": {}, "id": "hillary", "text_speach": " I am not going to make promises I can't keep. I am not going to talk about big ideas like single-payer and then not level with people about how much it will cost."}, {"entities": {"$15 million": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.01"}}, "id": "sanders", "text_speach": " What being part of the establishment is, is, in the last quarter, having a super PAC that raised $15 million from Wall Street, that throughout one's life raised a whole lot of money from the drug companies and other special interests.\n To my mind, if we do not get a handle on money in politics and the degree to which big money controls the political process in this country, nobody is going to bring about the changes that is needed in this country for the middle class and working families.\n"}, {"entities": {}, "id": "sanders", "text_speach": " What...\n"}, {"entities": {"CLINTON": {"sent.score": "-0.376308", "type": "Person", "sent": "negative", "rel": "0.974655"}}, "id": "hillary", "text_speach": " And I have stood up and I have represented my constituents to the best of my abilities, and I'm very proud of that.\n CLINTON: So I think it's time to end the very artful smear that you and your campaign have been carrying out...\n"}, {"entities": {}, "id": "hillary", "text_speach": " ... in recent weeks, and let's talk...\n ... let's talk about about the issues. Let's talk about the issues that divide us.\n"}, {"entities": {"CLINTON": {"sent.score": "-0.207353", "type": "Person", "sent": "negative", "rel": "0.896311"}}, "id": "hillary", "text_speach": " And let's — let's...\n CLINTON: ... we both agree with campaign finance reform.\n"}, {"entities": {"CLINTON": {"sent.score": "-0.359765", "type": "Person", "sent": "negative", "rel": "0.987896"}}, "id": "hillary", "text_speach": " I — I worked hard for McCain-Feingold.\n CLINTON: I want to reverse Citizens United.\n"}, {"entities": {}, "id": "hillary", "text_speach": " And so — let's talk about issues.\n Well, some people might think, yeah, that had some influence.\n"}, {"entities": {"Senator": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.33"}}, "id": "hillary", "text_speach": " Well, you know, Senator, I don't think — I don't...\n"}, {"entities": {"Lehman Brothers": {"sent.score": 0, "type": "Company", "sent": "neutral", "rel": "0.927354"}}, "id": "hillary", "text_speach": " ... I don't think you could find any person in political life today who has been subjected to more attacks and had more money spent against her by special interests, among whom you have named a few, than I.\n But while we're talking about votes, you're the one who voted to deregulate swaps and derivatives in 2000, which contributed to the over-leveraging of Lehman Brothers, which was one of the culprits that brought down the economy.\n So I don't know — I'm not impugning your motive because you voted to deregulate swaps and derivatives. People make mistakes and I'm certainly not saying you did it for any kind of financial advantage. What we've got to do as Democrats — what we've got to do as Democrats is to be united to actually solve these problems. And what I believe is that I have a better track record and a better opportunity to actually get that job done.\n That's what this election should be about.\n"}, {"entities": {"Secretary Clinton": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.879192"}, "commercial banks": {"sent.score": "0.304009", "type": "FieldTerminology", "sent": "positive", "rel": "0.774493"}, "YouTube": {"sent.score": 0, "type": "Company", "sent": "neutral", "rel": "0.655153"}, "Great Depression": {"sent.score": "-0.809906", "type": "FieldTerminology", "sent": "negative", "rel": "0.811758"}, "Robert Rubin": {"sent.score": "-0.326579", "type": "Person", "sent": "negative", "rel": "0.745124"}, "Alan Greenspan": {"sent.score": "0.304009", "type": "Person", "sent": "positive", "rel": "0.783165"}, "insurance companies": {"sent.score": "0.304009", "type": "FieldTerminology", "sent": "positive", "rel": "0.537197"}, "House Financial Committee": {"sent.score": "-0.219504", "type": "Organization", "sent": "negative", "rel": "0.969802"}}, "id": "sanders", "text_speach": " I think as Secretary Clinton knows, there is nobody who fought harder. I was on the House Financial Committee at that time. I heard the arguments coming from Democrats and Republicans — Robert Rubin, Alan Greenspan — about great an idea it would be if we did away with Glass-Steagall and if we allowed investor banks and commercial banks and big insurance companies to merge.\n Go to YouTube today. Look up Greenspan-Sanders. Listen to what I told them then. I helped lead the effort against deregulation. Unfortunately, we lost that. The result is — was the worst financial disaster since the Great Depression.\n"}, {"entities": {"Iowa": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.681953"}, "California": {"sent.score": "0.235027", "type": "StateOrCounty", "sent": "positive", "rel": "0.668759"}, "New Hampshire": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.767876"}, "Chuck": {"sent.score": "-0.2715", "type": "Person", "sent": "negative", "rel": "0.878173"}, "secretary": {"sent.score": "-0.309986", "type": "JobTitle", "sent": "negative", "rel": "0.82812"}}, "id": "sanders", "text_speach": " Chuck, actually we looked at it, but it turns out to be a disaster. The way it is structured right now, if you make it all the way to California, you could do pretty well. But in terms of the early states — Iowa, New Hampshire, the other states — it just doesn't work.\n Your point is well taken. I believe in public funding of elections, absolutely. But this system is — I don't know if the secretary would agree — is currently very antiquated and no longer applies to modern day politics.\n"}, {"entities": {}, "id": "sanders", "text_speach": " But if the...\n"}, {"entities": {"president": {"sent.score": "-0.488172", "type": "JobTitle", "sent": "negative", "rel": "0.802451"}, "America": {"sent.score": "-0.403249", "type": "Country", "sent": "negative", "rel": "0.590982"}, "Chuck": {"sent.score": "-0.333683", "type": "Person", "sent": "negative", "rel": "0.785982"}, "$27": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.590982"}}, "id": "sanders", "text_speach": " — but Chuck, it is a public financing system that everybody knows is antiquated. It no longer works. Nobody can become president based on that system. So what's the alternative? There are two alternatives. And, you know, we looked at it. Well, should we do a Super PAC, but I concluded, honestly, I don't represent Corporate America or billionaires, I didn't want it.\n So the other alternative was to ask working families and the middle class to help out in a transformational campaign. And you know what? We got 3.5 million individual contributions, $27 a piece. I think that's pretty good.\n"}, {"entities": {"secretary of State": {"sent.score": "-0.28596", "type": "FieldTerminology", "sent": "negative", "rel": "0.844421"}, "CLINTON": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.500728"}, "Karl Rove": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.598364"}, "CEO": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.511475"}, "American Camping Association": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.570125"}, "Rachel": {"sent.score": "-0.0605211", "type": "Person", "sent": "negative", "rel": "0.820736"}, "Goldman Sachs": {"sent.score": "-0.219089", "type": "Company", "sent": "negative", "rel": "0.720474"}, "$6 million": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.500728"}}, "id": "hillary", "text_speach": " On the issue of Wall Street.\n Last night, when you were asked about speaking fees and the amount of speaking fees you got from Goldman Sachs speeches, you said that's what they offered.\n Have you been too dismissive of voters' concerns about this issue in your own campaign and your own career?\n CLINTON: Well you know, Rachel, I think I may not have done the job I should in explaining my record. You know, I did — when I left the secretary of State's office, like so many former officials, military leaders, journalists, others, I did go on the speaking circuit. I spoke to heart doctors, I spoke to the American Camping Association, I spoke to auto dealers, and yes, I spoke to firms on Wall Street. They wanted me to talk about the world, what my experience had been as secretary of State.\n But what I want people to know is I went to Wall Street before the crash. I was the one saying you're going to wreck the economy because of these shenanigans with mortgages. I called to end the carried interest loophole that hedge fund managers enjoy. I proposed changes in CEO compensation.\n I called for a consumer protection financial bureau before it was created. And I think the best evidence that the Wall Street people at least know where I stand and where I have always stood is because they are trying to beat me in this primary. They have collected and spent as much as $6 million on these ads. Hedge fund billionaires, Karl Rove, another billionaire, jumped in.\n And why are they doing that? These are guys who try to make smart investments. They know my record, they know me, they know that I say what I believe and I will do it. And I also have a pretty good understanding about how to stop them.\n So I do want people to know that, and I think it's important for everybody to understand I have a record, I have stood firm and I will be the person who prevents them from ever wrecking the economy again.\n"}, {"entities": {"break up": {"sent.score": "-0.588419", "type": "FieldTerminology", "sent": "negative", "rel": "0.716843"}, "insurance companies": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.866949"}}, "id": "hillary", "text_speach": " If I could, let me just say that of course it has to change. It has to change. And that's why I have put forward a plan to do just that. And it's been judged to be the toughest, most effective and comprehensive one.\n You know, we now have power under the Dodd-Frank legislation to break up banks. And I've said I will use that power if they pose a systemic risk. But I want to go further, because it was investment banks, it was insurance companies, it was mortgage companies, all of which contributed.\n So let's not just be narrowly focused on one part of the problem. We have a lot of issues with corporate power that have to be addressed. My plan takes us further and it would do the job.\n"}, {"entities": {"senator": {"sent.score": "0.41782", "type": "JobTitle", "sent": "positive", "rel": "0.551158"}, "Paul Krugman": {"sent.score": "-0.312658", "type": "Person", "sent": "negative", "rel": "0.567685"}, "President Obama": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.772533"}, "Barney Frank": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.525613"}}, "id": "hillary", "text_speach": " Look we have a law — look, you know, I — I appreciate the senator's advocacy. We have a law. It was passed. It was signed by President Obama. It lays out a process that you go through to determine whether a systemic risk is posed.\n But that is not enough. And I keep going back to this because part of the reason the Wall Street guys are trying so hard to stop me — the hedge fund guys, the shadow banking guys — is because I've got their number on all of that. And my plan goes so much further to try to prevent the problems of the future.\n You know, we can't just fight the last war. We've got to be prepared to stop these guys if they ever try to use their economic power once again, to hurt the economy, and to hurt so many Americans. And my plan, Paul Krugman, Barney Frank, a lot of experts who understand what the new challenges might be, have said I am exactly on point, and the Wall Street guys actually know that.\n"}, {"entities": {"United States": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.758683"}, "America": {"sent.score": "-0.293217", "type": "Continent", "sent": "negative", "rel": "0.660551"}, "58 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.660551"}, "$10 trillion": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.660551"}}, "id": "sanders", "text_speach": " Well, we've had a number of economists supporting our legislation. And here's where we are. The American people can judge. Six largest financial institutions in America today have assets of roughly $10 trillion; equivalent to 58 percent of the GDP of the United States of America.SANDERS That is a lot of power for six financial institutions. That's it. I think it is too much power. Too much economic power, too much political power, and the economists that I talk to say we should break them up.\n"}, {"entities": {"oil companies": {"sent.score": "-0.702964", "type": "FieldTerminology", "sent": "negative", "rel": "0.910699"}, "pharmaceutical companies": {"sent.score": "-0.227646", "type": "FieldTerminology", "sent": "negative", "rel": "0.949259"}, "Bin Laden": {"sent.score": "-0.833388", "type": "Person", "sent": "negative", "rel": "0.95227"}, "energy companies": {"sent.score": "-0.739354", "type": "FieldTerminology", "sent": "negative", "rel": "0.943068"}, "President": {"sent.score": "-0.833388", "type": "JobTitle", "sent": "negative", "rel": "0.651754"}, "Valeant": {"sent.score": "-0.227646", "type": "Company", "sent": "negative", "rel": "0.616219"}}, "id": "hillary", "text_speach": " I will look into it. I don't know the status, but I will certainly look into it. But, I can only repeat what is the fact that I spoke to a lot of different groups with a lot of different constituents, a lot of different kinds of members about issues that had to do with world affairs. I probably described more times than I can remember how stressful it was advising the President about going after Bin Laden.\n I want to go after the pharmaceutical companies like Valeant, and Turns that are increasing prices without any regard to the impact on people's health. Now, if all we're going to talk about is one part of our economy, and indeed one streak in our economy, we're missing the big oil companies. We're missing other big energy companies. We're missing the big picture, and I have a record of trying to go at the problems that actually exist, and I will continue to do that.\n"}, {"entities": {"United States": {"sent.score": "-0.451181", "type": "Country", "sent": "negative", "rel": "0.351911"}, "billion dollar": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.351911"}, "fraud": {"sent.score": 0, "type": "Crime", "sent": "neutral", "rel": "0.575574"}, "madam Secretary": {"sent.score": "-0.411378", "type": "Person", "sent": "negative", "rel": "0.965579"}, "Secretary": {"sent.score": "0.446902", "type": "JobTitle", "sent": "positive", "rel": "0.508679"}}, "id": "sanders", "text_speach": " Yeah, I do. I agree with much of what the Secretary said, but, madam Secretary, it is not one streak. Wall Street is an entity of unbelievable economic and political power. That's a fact.\n And, I want to say something, and it may sound harsh, not to you, but to the American people. In a sense, in my view, the business model of Wall Street is fraud. It's fraud. I believe that corruption is rampant, and the fact that major bank after major bank has reached multi billion dollar settlements with the United States government when we have a weak regulator system tells me that not only did we have to bail them out once, if we don't start breaking them up, we're going to have to bail them out again, and I do not want to see that happen...\n"}, {"entities": {"CLINTON": {"sent.score": "-0.404494", "type": "Person", "sent": "negative", "rel": "0.355235"}, "MADDOW": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.392133"}, "Iraqi army": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.472647"}, "United States": {"sent.score": "0.405195", "type": "Country", "sent": "positive", "rel": "0.425698"}, "president": {"sent.score": "0.353483", "type": "JobTitle", "sent": "positive", "rel": "0.80475"}, "Syria": {"sent.score": "-0.337544", "type": "Country", "sent": "negative", "rel": "0.811596"}, "Iraq": {"sent.score": "-0.337544", "type": "Country", "sent": "negative", "rel": "0.796272"}, "Anbar": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.367186"}}, "id": "hillary", "text_speach": " Well, I think what the president understands, and what he's trying to do, is that we have to support the Arab and Kurdish fighters on the ground who are actually doing the fighting.\n But we do have special forces, we do have trainers, we do have the military personnel who are helping with the airstrikes that the United States is leading so that we can try to take out ISIS infrastructure, take out their leadership.\n And I think that, given the threat that ISIS poses to the region and beyond, as we have sadly seen in our own country, it is important to keep the Iraqi army on a path where they can actually take back territory, to work with the Sunni tribes in Anbar province and elsewhere so that their fighters can be also deployed, to work with the Kurds to provide them the support, but they're doing the fighting. We're doing the support and enabling.\n And I also think we've got to do more to stop foreign fighters, foreign funding and take ISIS on online, as well as doing everything necessary to keep us safe at home.\n So as I look at what the president it doing, it adds up to me. We just have to keep — try to get more support for those people on the ground in Syria and Iraq who have to actually physically take the territory back. MADDOW: To be clear, to the specific question, if that strategic goal that you're describing requires considerably more of Americans — an ever-increasing number of Americans in Iraq and maybe in Syria, are you OK with the numbers increasing?\n CLINTON: No. I mean, of course that's a theoretical question, and we don't know what it would be for, and we don't know how many numbers there are. I am against American combat troops being in Syria and Iraq.\n I support special forces. I support trainers. I support the air campaign. And I think we're making some progress. I want to continue to intensify that, and that's exactly what the president is doing.\n"}, {"entities": {"Saddam Hussein": {"sent.score": "-0.54176", "type": "Person", "sent": "negative", "rel": "0.869957"}, "Iraq": {"sent.score": "-0.33707", "type": "Country", "sent": "negative", "rel": "0.534174"}, "ISIS": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.547885"}, "secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.520596"}}, "id": "sanders", "text_speach": " OK. Let me agree with much of what the secretary said, but where we have a different background on this issue is we differ on the war in Iraq, which created barbaric organizations like ISIS.\n Not only did I vote against that war, I helped lead the opposition, and if you go to my website,berniesanders.com, you will see the statement that I made in 2002. And it gives me no pleasure to tell you that much of what I feared would happen the day after Saddam Hussein was overthrown, in fact, did happen.\n"}, {"entities": {"CLINTON": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.826052"}}, "id": "hillary", "text_speach": " If I could — if I could...\n CLINTON: ... respectfully add — look, we did differ. A vote in 2002 is not a plan to defeat ISIS. We have to look at the threats that we face right now...\n"}, {"entities": {"SANDERS": {"sent.score": "-0.314333", "type": "Person", "sent": "negative", "rel": "0.774815"}, "U.K.": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.481681"}, "Germany": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.501755"}, "King Abdullah": {"sent.score": "0.534003", "type": "Person", "sent": "positive", "rel": "0.732579"}, "U.S.": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.531948"}, "France": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.544144"}, "military equipment": {"sent.score": "0.511104", "type": "FieldTerminology", "sent": "positive", "rel": "0.756281"}, "Jordan": {"sent.score": "0.0484559", "type": "Person", "sent": "positive", "rel": "0.930055"}, "Middle East": {"sent.score": 0, "type": "Region", "sent": "neutral", "rel": "0.744473"}, "Syria": {"sent.score": "-0.510066", "type": "Country", "sent": "negative", "rel": "0.754144"}, "Iraq": {"sent.score": "-0.510066", "type": "Country", "sent": "negative", "rel": "0.714757"}, "Russia": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.541205"}, "secretary": {"sent.score": "0.534003", "type": "JobTitle", "sent": "positive", "rel": "0.690694"}}, "id": "sanders", "text_speach": " Well, I think our great task is to make certain that our young men and women in the military do not get sucked into never- ending, perpetual warfare within the quagmire of Syria and Iraq. And I will do my very best to make sure that that doesn't happen.\n I agree with the secretary that I think what has to happen — and let me just mention what King Abdullah of Jordan said. I think he hit the nail on the head. SANDERS: And what he said is essentially the war against ISIS is a war for the soul of Islam. And it must be Muslim troops on the ground that will destroy ISIS, with the support of a coalition of major powers — U.S., U.K., France, Germany and Russia.\n So our job is to provide them the military equipment that they need; the air support they need; special forces when appropriate. But at the end of the day for a dozen different reasons, not the least of which is that ISIS would like American combat troops on the ground so they could reach out to the Muslim world and say, “Look, we're taking on those terrible Americans.”\n The combat on the ground must be done by Muslim troops with our support. We must not get involved in perpetual warfare in the Middle East.\n"}, {"entities": {"Ramadi": {"sent.score": "-0.35755", "type": "City", "sent": "negative", "rel": "0.32818"}, "Iraq": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.407134"}, "Taliban": {"sent.score": "0.0147051", "type": "Organization", "sent": "positive", "rel": "0.715516"}, "Iraqi army": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.503807"}, "40 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.32818"}}, "id": "sanders", "text_speach": " Well, you can't simply withdraw tomorrow. Wish we could, and allow, you know, the Taliban or anybody else to reclaim that country. But what we must do, and what we have seen in recent months, is some progress in Iraq, where finally the Iraqi army, which has not been a particularly effective fighting force, retook Ramadi. ISIS has lost I think 40 percent of the territory that it held in the last year.\n Hopefully, and you know, one can't predict the future, that maybe our training and their fighting capabilities are improving and we are going to make some progress in destroying ISIS.\n"}, {"entities": {"partner": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.300548"}, "Afghanistan": {"sent.score": "-0.315026", "type": "Country", "sent": "negative", "rel": "0.386491"}, "South Asia": {"sent.score": "-0.317979", "type": "Region", "sent": "negative", "rel": "0.333416"}, "nuclear program": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.348106"}, "Abdullah": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.34855"}, "Afghan army": {"sent.score": "-0.256428", "type": "Organization", "sent": "negative", "rel": "0.993996"}, "president": {"sent.score": "-0.315026", "type": "JobTitle", "sent": "negative", "rel": "0.604338"}, "North Africa": {"sent.score": "-0.317979", "type": "Region", "sent": "negative", "rel": "0.324004"}, "Ashraf Ghani": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.446043"}}, "id": "hillary", "text_speach": " Oh, absolutely. The president decided to leave more troops than he had originally planned in Afghanistan. We have a very cooperative government there, with Ashraf Ghani and his top — his top partner, Abdullah. And they are doing their very best. And the Afghan army is actually fighting. The Afghan army is taking heavy losses defending Afghan territory.\n So, we've got this arc of instability from North Africa to South Asia, and we have to pay close attention to it. And we have to build coalitions, something that I did to take on the Iranian nuclear program, and what I will do as president to make sure that we defeat these terrorist networks.\n"}, {"entities": {"Georgetown": {"sent.score": "-0.287144", "type": "City", "sent": "negative", "rel": "0.275286"}, "Sanders": {"sent.score": "-0.445434", "type": "Person", "sent": "negative", "rel": "0.254892"}, "United States": {"sent.score": "-0.405278", "type": "Country", "sent": "negative", "rel": "0.228421"}, "foreign policy": {"sent.score": "-0.404616", "type": "FieldTerminology", "sent": "negative", "rel": "0.91037"}, "president": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.216824"}, "Iraq": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.375611"}, "secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.242223"}}, "id": "sanders", "text_speach": " Well, that's not quite accurate. I did give a speech at Georgetown where I talked about democratic socialism and foreign policy. Maybe I shouldn't have combined the two in the same speech, because the foreign policy part of it didn't get much attention. So, let me take this opportunity to give you a very short speech here on the issue.\n I think, while it is true that the secretary and I voted differently on the war in Iraq, what is important is that we learn the lesson of the war in Iraq. And that lesson is intrinsic to my foreign policy if elected president, is the United States cannot do it alone. We cannot be the policeman of the world. We are now spending more I believe than the next eight countries on defense. We have got to work in strong coalition with the major powers of the world and with those Muslim countries that are prepared to stand up and take on terrorism.\n So I would say that the key doctrine of the Sanders administration would be no, we cannot continue to do it alone; we need to work in coalition.\n"}, {"entities": {"Saudi Arabia": {"sent.score": "-0.558294", "type": "Country", "sent": "negative", "rel": "0.52484"}, "Iran": {"sent.score": "-0.558294", "type": "Country", "sent": "negative", "rel": "0.359748"}, "Senator Sanders": {"sent.score": "-0.275636", "type": "Person", "sent": "negative", "rel": "0.81077"}, "Israel": {"sent.score": "0.245927", "type": "Country", "sent": "positive", "rel": "0.38021"}, "foreign policy": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.462839"}, "Syria": {"sent.score": "-0.404843", "type": "Country", "sent": "negative", "rel": "0.431691"}, "military intelligence": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.48276"}}, "id": "hillary", "text_speach": " A group of national security experts, military intelligence experts, issued a very concerning statement about Senator Sanders's views on foreign policy and national security, pointing out some of the comments he has made on these issues, such as inviting Iranian troops into Syria to try to resolve the conflict there; putting them right at the doorstep of Israel. Asking Saudi Arabia and Iran to work together, when they can't stand each other and are engaged in a proxy battle right at this moment."}, {"entities": {"Secretary Clinton": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.921767"}, "secretary of State": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.798518"}, "Saudi Arabia": {"sent.score": "-0.452869", "type": "Country", "sent": "negative", "rel": "0.658552"}, "Iran": {"sent.score": "-0.452869", "type": "Country", "sent": "negative", "rel": "0.485855"}, "four years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.485855"}, "John Kerry": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.595338"}, "Iraq": {"sent.score": "-0.208477", "type": "Country", "sent": "negative", "rel": "0.520824"}}, "id": "sanders", "text_speach": " (OFF-MIKE) I fully, fully concede that Secretary Clinton, who was secretary of State for four years, has more experience — hat is not arguable — in foreign affairs. But experience is not the only point, judgment is. And once again, back in 2002, when we both looked at the same evidence about the wisdom of the war in Iraq, one of us voted the right way and one of us didn't.\n In terms of Iran and in terms of Saudi Arabia, of course they hate each other. That's no great secret. But John Kerry, who is I think doing a very good job, has tried to at least get these people in the room together because both of them are being threatened by ISIS.\n"}, {"entities": {}, "id": "sanders", "text_speach": " Well...\n"}, {"entities": {"president": {"sent.score": "-0.505916", "type": "JobTitle", "sent": "negative", "rel": "0.617173"}, "Hezbollah": {"sent.score": "-0.422244", "type": "Organization", "sent": "negative", "rel": "0.778042"}, "Lebanon": {"sent.score": "-0.422244", "type": "Country", "sent": "negative", "rel": "0.59911"}, "Israel": {"sent.score": "-0.422244", "type": "Country", "sent": "negative", "rel": "0.58336"}, "Hamas": {"sent.score": "-0.422244", "type": "Organization", "sent": "negative", "rel": "0.564684"}}, "id": "hillary", "text_speach": " Absolutely. You know, I did put together the coalition to impose sanctions. I actually started the negotiations that led to the nuclear agreement, sending some much my closest aides to begin the conversations with the Iranians.\n They are destabilizing governments in the region. They continue to support Hezbollah and Hamas in Lebanon against Israel. A lot of work that we have do is going to be incredibly hard. I'm prepared to do that work, but I believe, just as I did with imposing the sanctions, you have to get action for action.\n If we were to normalize relations right now, we would remove one of the biggest pieces of leverage we have to try to influence and change Iranian behavior. The president doesn't think we should. I certainly don't think we should. I believe we have to take this step by step to try to reign in Iranian aggression, their support for terrorism and the other bad behavior that can come back and haunt us.\n"}, {"entities": {"Senator": {"sent.score": "0.54153", "type": "JobTitle", "sent": "positive", "rel": "0.92773"}}, "id": "hillary", "text_speach": " Well Senator, let me just correct the record if I can. You know — let me correct the record.\n"}, {"entities": {}, "id": "hillary", "text_speach": " As I — as I certainly recall, the question was to meet with without conditions. And you're right, I was against that. I was against it then I would be against it now.SANDERS: OK.\n That's not the way it works.\n"}, {"entities": {"Iran": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.822319"}, "CLINTON": {"sent.score": "-0.348684", "type": "Person", "sent": "negative", "rel": "0.922561"}, "President": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.676209"}}, "id": "hillary", "text_speach": " ... Well, we set conditions on Iran. We worked hard to get them established, and to be enforced, and then we talked. That's exactly the right...\n CLINTON: ... And, that's what I did with the President, so he and I are on the very same page.\n"}, {"entities": {"Iran": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.33"}}, "id": "sanders", "text_speach": " Just to set the record straight, I very strongly supported the agreement which makes certain that Iran does not get a nuclear weapon.\n"}, {"entities": {}, "id": "sanders", "text_speach": " ... ISIS...\n"}, {"entities": {}, "id": "sanders", "text_speach": " ISIS, you forgot one...\n"}, {"entities": {}, "id": "sanders", "text_speach": " ... No, no...\n"}, {"entities": {}, "id": "sanders", "text_speach": " ... ISIS would be ...\n"}, {"entities": {"North Korea": {"sent.score": "-0.250086", "type": "Country", "sent": "negative", "rel": "0.728149"}, "Ukraine": {"sent.score": "-0.490513", "type": "Country", "sent": "negative", "rel": "0.26868"}, "nuclear weapons": {"sent.score": "-0.201478", "type": "FieldTerminology", "sent": "negative", "rel": "0.388915"}, "Putin": {"sent.score": "-0.490513", "type": "Person", "sent": "negative", "rel": "0.336758"}, "China": {"sent.score": "0.27659", "type": "Country", "sent": "positive", "rel": "0.934832"}}, "id": "sanders", "text_speach": " Clearly North Korea is a very strange situation because it is such an isolated country run by a handful of dictators, or maybe just one, who seems to be somewhat paranoid. And, who had nuclear weapons.\n And, our goal there, in my view, is to work and lean strongly on China to put as much pressure. China is one of the few major countries in the world that has significant support for North Korea, and I think we got to do everything we can to put pressure on China. I worry very much about an isolated, paranoid country with atomic bombs.\n I think, clearly, we got to work closely with China to resolve the serious problems we have, and I worry about Putin and his military adventurism in the Crimea and the Ukraine.\n"}, {"entities": {"North Korea": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.90998"}, "nuclear weapons": {"sent.score": "-0.339112", "type": "FieldTerminology", "sent": "negative", "rel": "0.966906"}, "China": {"sent.score": "0.511171", "type": "Country", "sent": "positive", "rel": "0.639762"}, "Russia": {"sent.score": "0.214785", "type": "Country", "sent": "positive", "rel": "0.716728"}}, "id": "sanders", "text_speach": " ... No, I don't. I worry very, very much about an isolated country. That's what makes me nervous. Russia lives in the world. China lives in the world. North Korea is a very, very strange country because it is so isolated, and I do feel that a nation with nuclear weapons, they have got to be dealt with. Dealt with effectively.\n"}, {"entities": {"Europe": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.202383"}, "nuclear weapons": {"sent.score": "-0.392509", "type": "FieldTerminology", "sent": "negative", "rel": "0.289036"}, "Putin": {"sent.score": "0.214644", "type": "Person", "sent": "positive", "rel": "0.239976"}, "Iran": {"sent.score": "-0.392509", "type": "Country", "sent": "negative", "rel": "0.265729"}, "Baltics": {"sent.score": "-0.256182", "type": "Country", "sent": "negative", "rel": "0.268734"}, "Hawaii": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.234109"}, "West Coast": {"sent.score": "-0.273912", "type": "Region", "sent": "negative", "rel": "0.224337"}, "Secretary Carter": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.85803"}, "NATO": {"sent.score": "0.476293", "type": "Organization", "sent": "positive", "rel": "0.335209"}, "Middle East": {"sent.score": 0, "type": "Region", "sent": "neutral", "rel": "0.233245"}, "Assad": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.239558"}, "Syria": {"sent.score": "-0.306736", "type": "Country", "sent": "negative", "rel": "0.241545"}, "Crimea": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.227507"}, "Russia": {"sent.score": 0, "type": "Country", "sent": "neutral", "rel": "0.336433"}}, "id": "hillary", "text_speach": " I haven't talked to Secretary Carter, but here's what I would think he's planning. We do have the nuclear weapons agreement with Iran, that's an enforcement consequence, action for action, follow on. We have a plan, we will watch them, we will be vigilant.\n And, I know that some of those plans could very well lead to a missile that might reach Hawaii, if not the West Coast. We do have to try to get the countries in the region to work with us to do everything we can to confine, and constrain them.\n But, what Secretary Carter is looking at is the constant pressure that Russia's putting on our European allies. The way that Russia is trying to move the boundaries of the post-World War II Europe. The way that he is trying to set European countries against one another, seizing territory, holding it in Crimea. Beginning to explore whether they could make some inroads in the Baltics.\n We know that they are deeply engaged in supporting Assad because they want to have a place in the Middle East. They have a naval base, they have an air base in Syria. They want to hang on to that. I think what Secretary Carter is seeing, and I'm glad he is, is that we got to get NATO back working for the common defense. We've got to do more to support our partners in NATO, and we have to send a very clear message to Putin that this kind of belligerence, that this kind of testing of boundaries will have to be responded to. The best way to do that is to put more armor in, put more money from the Europeans in so they're actually contributing more to their own defense.\n"}, {"entities": {"Rachel": {"sent.score": "0.219935", "type": "Person", "sent": "positive", "rel": "0.560277"}, "Senator Sanders": {"sent.score": "-0.372131", "type": "Person", "sent": "negative", "rel": "0.848959"}, "America": {"sent.score": "0.199673", "type": "Continent", "sent": "positive", "rel": "0.628289"}, "Congress": {"sent.score": "-0.372131", "type": "Organization", "sent": "negative", "rel": "0.555115"}, "Koch": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.560981"}}, "id": "hillary", "text_speach": " Well, first of all, I'm absolutely against privatizing the V.A. And I am going do everything I can to build on the reforms that Senator Sanders and others in Congress have passed to try to fix what's wrong with the V.A.\n But you're absolutely right, you know, Rachel, this is another part of the Koch brothers agenda. They've actually formed an organization to try to begin to convince Americans we should no longer have guaranteed health care, specialized care for our veterans.\n I will fight that as hard as I can. I think there's where we can enlist the veterans service organizations, the veterans of America, because, yes, let's fix the V.A., but we will never let it be privatized, and that is a promise.\n"}, {"entities": {"Senate Committee on Veterans' Affairs": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.953765"}, "Secretary Clinton": {"sent.score": "-0.159112", "type": "Person", "sent": "negative", "rel": "0.702696"}, "Social Security": {"sent.score": "-0.447446", "type": "FieldTerminology", "sent": "negative", "rel": "0.31387"}, "American Legion": {"sent.score": "-0.295114", "type": "Organization", "sent": "negative", "rel": "0.385325"}, "Senate": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.42597"}, "Rachel": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.359622"}, "John McCain": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.416654"}, "Vietnam Vets": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.380657"}, "Jeff Miller": {"sent.score": "-0.601466", "type": "Person", "sent": "negative", "rel": "0.368319"}, "Medicare": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.306538"}, "Concerned Veterans of America": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.717984"}, "Koch": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.672613"}, "VFW": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.354957"}, "Medicaid": {"sent.score": "-0.244789", "type": "Organization", "sent": "negative", "rel": "0.292895"}, "the House": {"sent.score": "-0.601466", "type": "FieldTerminology", "sent": "negative", "rel": "0.273636"}, "America": {"sent.score": 0, "type": "Continent", "sent": "neutral", "rel": "0.363452"}, "secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.476573"}}, "id": "sanders", "text_speach": " Let me agree. You know, as the secretary knows, I chaired — I had the privilege and the honor of chairing the Senate Committee on Veterans' Affairs. And it is interesting to me, you know, Republicans give a lot of speeches about how much they love veterans. I work with the American Legion, the VFW, the DAV, the Vietnam Vets, and virtually every veterans organization to put together the most comprehensive piece of the veterans legislation in the modern history of America. That's what I did.\n And I brought it to the floor of the Senate. Every Democrat voted for it, I got two Republicans. We ended up with 56 votes and I couldn't get the 60 votes that I needed. That is pathetic.\n This was legislation supported by all of the veterans organizations, addressing many of the serious problems that veterans face in health care and in how we deliver benefits to them.\n So Republicans talk a good game about veterans, but when it came to put money on the line to protect our veterans, frankly, they were not there.\n What I did next, Rachel, is I had to retreat a little bit, I had to compromise. I did work with John McCain. I did work with Jeff Miller over in the House. And we put together not the bill that I wanted, but probably the most comprehensive V.A. health care bill in the modern history of this country.\n Secretary Clinton is absolutely right, there are people, Koch brothers among others, who have a group called Concerned Veterans of America, funded by the Koch brothers. The Koch brothers, by the way, want to destroy Social Security, Medicare, Medicaid, every governmental program passed since the 1930s. Yes, there are people out there who want to privatize it.\n The last point that I'd make. I had a hearing. I had all of the veterans groups in front of me. And I said to them, tell me when a veteran gets in to the V.A., understanding there are waiting lines and real problems, when a veteran gets into the system, is the quality of care good?\n Without exception, what they said, good, excellent, very good. We've got to strengthen the V.A. We do not privatize the V.A.\n"}, {"entities": {"Des Moines Register": {"sent.score": "0.343733", "type": "PrintMedia", "sent": "positive", "rel": "0.98196"}}, "id": "sanders", "text_speach": " Well, I agree with the Des Moines Register, but let's not blow this out of proportion. This is not a — this is not, like, a winner-take-all thing.\n I think where we now stand — correct me if I'm wrong — you have 22 delegates, I have 20 delegates. We need 2,500 delegates to win the nomination.\n"}, {"entities": {"CLINTON": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.97779"}}, "id": "hillary", "text_speach": " Whatever they decide to do, that's fine.\n CLINTON: All right.\n"}, {"entities": {"White House": {"sent.score": "0.208659", "type": "Facility", "sent": "positive", "rel": "0.55365"}, "Republicans": {"sent.score": "-0.654797", "type": "Organization", "sent": "negative", "rel": "0.381325"}, "Iowa": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.377353"}, "Trump": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.433755"}, "Senate": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.370022"}, "Rachel": {"sent.score": "0.24386", "type": "Person", "sent": "positive", "rel": "0.495968"}, "voter suppression": {"sent.score": "-0.492832", "type": "FieldTerminology", "sent": "negative", "rel": "0.831659"}, "New Hampshire": {"sent.score": "-0.4687", "type": "StateOrCounty", "sent": "negative", "rel": "0.648361"}, "Democrats": {"sent.score": "0.661743", "type": "Organization", "sent": "positive", "rel": "0.678769"}, "Wisconsin": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.346076"}, "secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.373841"}}, "id": "sanders", "text_speach": " Well, you know, a general election is different than a primary and caucus process. But let me just say this. In terms of where we are right now, as you mention, Rachel, in a number of national and state, including New Hampshire. For example, the last poll I saw — there may have been a new one — last one I saw here in New Hampshire, a battleground state, had me defeating Trump by 19; the secretary defeating him by one. There were also pretty large margins in Iowa and Wisconsin.\n These are polls. Polls go up. Polls go down. But here's why I think I will be, if nominated, the strongest candidate. Democrats win when there is a large voter turnout; when people are excited; when working people, middle class people and young people are prepared to engage in the political process.\n Republicans win when people are demoralized and you have a small voter turnout, which by the way is why they love voter suppression. I believe that our campaign up to now has shown that we can create an enormous amount of enthusiasm from working people, from young people, who will get involved in the political process and which will drive us to a very large voter turnout.\n If there is a large voter turnout, not only do we retain the White House, but I think we regain the Senate. We win governors' chairs up and down the line. So I believe if you want to retain the White House, if you want to see Democrats do well across the board, I think our campaign is the one that creates the large voter turnout and helps us win.\n"}, {"entities": {"Republicans": {"sent.score": "0.560039", "type": "Organization", "sent": "positive", "rel": "0.583364"}, "Senator Sanders": {"sent.score": "0.288135", "type": "Person", "sent": "positive", "rel": "0.92309"}, "President Obama": {"sent.score": "0.65126", "type": "Person", "sent": "positive", "rel": "0.575744"}}, "id": "hillary", "text_speach": " I can only tell you what I believe, and that is that I am the strongest candidate to take it to the Republicans and win in November.\n And I say that with great — with great respect for the campaign that Senator Sanders has been running. I personally am thrilled at the numbers of people, and particularly young people who are coming to support your campaign. I hope that I will be able to earn their support. They may not support me now, but I support them and we'll work together.\n But what I'm concerned about is the views of many Democrats who know their states, who know how hard it is to win a general election. And it also will push whoever the nominee is into the spotlight. I've been vetted. There's hardly anything you don't know about me. And I think it's fair to say that whoever is in that position, Senator Sanders or anyone else who might have run, will face the most withering onslaught.\n So, I think that I am the person who can do all aspects of the job. I think I'm the person best prepared to take the case to the Republicans. And I think that at the end of the day, it's not so much electability. It is who the American people can believe can keep them safe, can get the economy moving again, can get incomes rising, can build on the progressive accomplishments of President Obama.\n And I think that the coalition that President Obama put together to win twice is a coalition that I can put together and add to. And that's what I'm prepared to...\n"}, {"entities": {"Benghazi": {"sent.score": "-0.20189", "type": "City", "sent": "negative", "rel": "0.596133"}, "11 hours": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.596133"}, "Secretary Powell": {"sent.score": "0.238462", "type": "Person", "sent": "positive", "rel": "0.976532"}}, "id": "hillary", "text_speach": " Absolutely I can. You know, before it was emails, it was Benghazi, and the Republicans were stirring up so much controversy about that. And I testified for 11 hours, answered their questions. They basically said yeah, didn't get her. We tried. That was all a political ploy.\n I agree completely with Secretary Powell, who said today this is an absurdity. And so I think the American people will know it's an absurdity. I have absolutely no concerns about it whatsoever.\n"}, {"entities": {"100 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.01"}}, "id": "hillary", "text_speach": " I am 100 percent confident. This is a security review that was requested. It is being carried out. It will be resolved. But I have to add if there's going to be a security review about me, there's going to have to be security reviews about a lot of other people, including Republican office holders, because we've got this absurd situation of retroactive classifications.\n"}, {"entities": {}, "id": "sanders", "text_speach": " (OFF-MIKE)\n"}, {"entities": {}, "id": "sanders", "text_speach": " I am feeling exactly the way I felt at the first debate. There's a process under way. I will not politicize it.\n"}, {"entities": {"secretary": {"sent.score": "-0.519789", "type": "JobTitle", "sent": "negative", "rel": "0.33"}}, "id": "sanders", "text_speach": " And by the way — and by the way, if I may, the secretary probably doesn't know that there's not a day that goes by when I am not asked to attack her on that issue, and I have refrained from doing that and I will continue to refrain from doing that.\n"}, {"entities": {}, "id": "sanders", "text_speach": " Not losing control of our campaign. You know, we have hired a whole lot of people in a rapid way and I am familiar with the first two instances and they are unacceptable, and we have apologized and dealt with that.\n In terms of the last one, as I understand it, we did not suggest that we had the endorsement of a newspaper. Newspapers who make endorsements also say positive things about other candidates, and to the best of my knowledge, that is what we did. So we never said, never said that somebody, a newspaper endorsed us that did not. What we did say is blah blah blah blah was said by the newspaper.\n"}, {"entities": {"secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.903733"}}, "id": "sanders", "text_speach": " But that was only for — that was not to be on television. That's an important point. That was just something — as the secretary knows, you put titles on ads and you send them out, but there was no word in that ad, none, that said that those newspapers had endorsed us.\n"}, {"entities": {"Boston": {"sent.score": "-0.263136", "type": "City", "sent": "negative", "rel": "0.672647"}, "Oklahoma City": {"sent.score": "-0.442791", "type": "City", "sent": "negative", "rel": "0.78256"}, "African Americans": {"sent.score": "-0.3778", "type": "FieldTerminology", "sent": "negative", "rel": "0.805378"}, "Secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.775333"}}, "id": "sanders", "text_speach": " ... Look, I hear what the Secretary said, and I understand, but look, there are — all of us know that we have seen in recent years horrible, horrible crimes. It's hard to imagine how people can do, bomb, and kill 168 people in Oklahoma City, or do the Boston Marathon bombing, but this is what I believe, and for a couple of reasons.\n Number one, too many innocent people, including minorities, African Americans, have been executed when they were not guilty. That's number one. We have to be very careful about making sure about that.\n But, second of all, and maybe, in a deeper reason, of course there are barbaric acts out there. But, in a world of so much violence and killing, I just don't believe that government itself should be part of the killing. So, when somebody commits...\n"}, {"entities": {}, "id": "sanders", "text_speach": " ... Somebody commits any of these terrible crimes that we have seen, you lock them up, and you toss away the key. They're never going to get out. But, I just don't' want to see government be part of killing. That's all. (APPLAUSE)\n"}, {"entities": {"town hall": {"sent.score": "0.717322", "type": "Facility", "sent": "positive", "rel": "0.321158"}, "Michigan": {"sent.score": "-0.370894", "type": "StateOrCounty", "sent": "negative", "rel": "0.384586"}, "Rachel": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.332066"}, "Flint": {"sent.score": "0.113108", "type": "City", "sent": "positive", "rel": "0.942495"}, "federal government": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.343549"}}, "id": "hillary", "text_speach": " Absolutely. Absolutely. You know, Rachel, you and I have talked about this before. I thank you for going to Flint to hold that town hall. I will be in Flint at the Mayor's invitation on Sunday to get an in depth briefing about what is, and is not happening.\n I absolutely believe that what is being done is not sufficient. We need to be absolutely clear about everything that should be done from today to tomorrow, into the future to try to remedy the terrible burden that the people of Flint are barring. That includes fixing their pipes, it includes guaranteeing whatever healthcare and educational embellishments they may need going forward, and I think the federal government has way where it can bill the state of Michigan. If Michigan won't do it, there have to be ways that we can begin to move, and then make them pay for it, and hold them accountable.\n"}, {"entities": {"Secretary": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.33"}}, "id": "sanders", "text_speach": " Absolutely. I think the Secretary described the situation appropriately.SANDERS"}, {"entities": {"public health": {"sent.score": "0.308778", "type": "FieldTerminology", "sent": "positive", "rel": "0.768863"}, "secretary": {"sent.score": "-0.611319", "type": "JobTitle", "sent": "negative", "rel": "0.83312"}}, "id": "sanders", "text_speach": " ... was so outrageous.\n What we are talking about are children being poisoned. That's what we're talking about. We don't know, no one knows for sure because they haven't done the appropriate studies, but there's no question that kids' intellectual development may have been impacted. We don't know how many thousands.\n The idea that there has not been a dramatic response is beyond comprehension. And when you have one of the, I think, significant public health crises of recent years, of course the federal government comes in.\n And of course the federal government says, you're not going to be poisoning little kids and impacting their entire lives.\n Last point on this. And I suspect the secretary agrees. One wonders if this were a white suburban community what kind of response there would have been.\n"}, {"entities": {"Michigan": {"sent.score": 0, "type": "StateOrCounty", "sent": "neutral", "rel": "0.551506"}, "Flint": {"sent.score": "-0.680914", "type": "City", "sent": "negative", "rel": "0.899347"}}, "id": "sanders", "text_speach": " Flint, Michigan, is a poor community. It is disproportionately African-American and minority. And what has happened there is absolutely unacceptable.\n"}, {"entities": {"Korea": {"sent.score": "-0.209895", "type": "Country", "sent": "negative", "rel": "0.416164"}, "President Bush": {"sent.score": "-0.209895", "type": "Person", "sent": "negative", "rel": "0.507967"}, "Chuck": {"sent.score": "-0.249427", "type": "Person", "sent": "negative", "rel": "0.477652"}, "UAW": {"sent.score": "0.265973", "type": "Organization", "sent": "positive", "rel": "0.424201"}, "5 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.416164"}, "global economy": {"sent.score": "0.523813", "type": "FieldTerminology", "sent": "positive", "rel": "0.74823"}, "95 percent": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.416164"}, "senator": {"sent.score": 0, "type": "JobTitle", "sent": "neutral", "rel": "0.834078"}, "America": {"sent.score": "-0.30494", "type": "Continent", "sent": "negative", "rel": "0.430537"}}, "id": "hillary", "text_speach": " You know, Chuck, I've only had responsibility for voting for trade agreements as a senator. And I voted a multinational trade agreement when I was senator, the CAFTA agreement, because I did not believe it was in the best interests of the workers of America, of our incomes, and I opposed it.\n I waited until it had actually been negotiated because I did want to give the benefit of the doubt to the administration. Once I saw what the outcome was, I opposed it.\n Now I have a very clear view about this. We have to trade with the rest of the world. We are 5 percent of the world's population. We have to trade with the other 95 percent. And trade has to be reciprocal. That's the way the global economy works.\n But we have failed to provide the basic safety net support that American workers need in order to be able to compete and win in the global economy. So it's not just what's in the trade agreement that I'm interested in.\n I did help to renegotiate the trade agreement that we inherited from President Bush with Korea. We go the UAW on board because of changes we made. So there are changes that I believe would make a real difference if they could be achieved, but I do not currently support it as it is written.\n"}, {"entities": {}, "id": "sanders", "text_speach": " Absolutely right.\n"}, {"entities": {"NAFTA": {"sent.score": "-0.448444", "type": "Organization", "sent": "negative", "rel": "0.870855"}, "30 years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.246394"}, "Chuck": {"sent.score": "-0.28506", "type": "Person", "sent": "negative", "rel": "0.324283"}, "free trade": {"sent.score": "0.424947", "type": "FieldTerminology", "sent": "positive", "rel": "0.943561"}, "Vietnam": {"sent.score": "-0.231268", "type": "Country", "sent": "negative", "rel": "0.269888"}, "China": {"sent.score": "0.37358", "type": "Country", "sent": "positive", "rel": "0.488242"}, "TPP": {"sent.score": 0, "type": "Organization", "sent": "neutral", "rel": "0.246394"}, "America": {"sent.score": "-0.438858", "type": "Continent", "sent": "negative", "rel": "0.496522"}, "secretary": {"sent.score": "-0.613844", "type": "JobTitle", "sent": "negative", "rel": "0.289906"}}, "id": "sanders", "text_speach": " Chuck, I believe in trade, but I do not believe in unfettered free trade. I believe in fair trade which works for the middle class and working families of this country and not just large multinational corporations.\n I was not only in opposition to NAFTA — and this is an area where the secretary and I have disagreements. I was not only in opposition to NAFTA, I was on the picket line in opposition to NAFTA because I understood — I don't think this is really rocket science.\n We heard all of the people tell us how many great jobs would be created. I didn't believe that for a second because I understood what the function of NAFTA, CAFTA, PNTR with China, and the TPP is, it's to say to American workers, hey, you are now competing against people in Vietnam who make 56 cents an hour minimum wage.\n I don't want American workers to compete against people making 56 cents an hour. I don't want companies shutting down in America, throwing people out on the street, moving to China, and bringing their products back into this country.SANDERS: So, do I believe in trade? Of course, I believe in trade. But the current trade agreements over the last 30 years were written by corporate America, for corporate America, resulted in the loss of millions of decent-paying jobs, 60,000 factories in America lost since 2001, millions of decent-paying jobs; and also a downward spiral, a race to the bottom where employers say, “Hey, you don't want to take a cut in pay? We're going to China.”\n Workers today are working longer hours for lower wages. Trade is one of the reasons for that.\n"}, {"entities": {"four years": {"sent.score": 0, "type": "Quantity", "sent": "neutral", "rel": "0.708756"}, "solar panels": {"sent.score": "-0.455018", "type": "FieldTerminology", "sent": "negative", "rel": "0.845919"}, "Chuck": {"sent.score": "-0.435867", "type": "Person", "sent": "negative", "rel": "0.708756"}}, "id": "hillary", "text_speach": " Well, I — I don't accept that premise, Chuck. I think that we've got so much business we have to do. We've talked a lot tonight about what we're against — we're against income inequality. We're against the abuses of powerful interests. We're against a lot of things.\n I want to have half a billion more solar panels deployed, the first four years.\n"}, {"entities": {}, "id": "sanders", "text_speach": " No, let...\n"}, {"entities": {"comprehensive immigration reform": {"sent.score": "0.898568", "type": "FieldTerminology", "sent": "positive", "rel": "0.976927"}}, "id": "sanders", "text_speach": " ... I am absolutely supportive of comprehensive immigration reform and a path towards citizenship for 11 million people today who are living in the shadows. All right? We got to do that.\n"}, {"entities": {"president": {"sent.score": "-0.389352", "type": "JobTitle", "sent": "negative", "rel": "0.77118"}, "labor market": {"sent.score": 0, "type": "FieldTerminology", "sent": "neutral", "rel": "0.779477"}, "CLINTON": {"sent.score": "-0.340849", "type": "Person", "sent": "negative", "rel": "0.79384"}, "Washington": {"sent.score": "0.636099", "type": "City", "sent": "positive", "rel": "0.723168"}, "comprehensive immigration reform": {"sent.score": "-0.326107", "type": "FieldTerminology", "sent": "negative", "rel": "0.888828"}}, "id": "hillary", "text_speach": " The answer to both of those is no. I'm interested in making what we have work better. I want to streamline programs that are duplicative and redundant. I want to have a top-to-bottom review about what works and what doesn't work, and be absolutely clear we're getting rid of what doesn't work.\n And when you put together a budget, you have to make a lot of hard decisions, but I think it's not appropriate to say “I'm going to get rid of this, get rid of that” until you have a very good process that gives you the information about what to do. CLINTON: But I want to add something else, you know, because look, we have so much work to do in our country, and I think it's the greatest work that Americans will be called to do. And of course, we have to have people in every community involved in it. We have to have the political voice, the political grassroots speaking up and speaking out about what we have to try to accomplish in Washington.\n But we also need to have a very clear set of goals that we are going to achieve, and we need to level with the American people about what they are, what they will cost, what will be expected of our citizenry. So I see as president having a constant dialogue with Americans here's what we're trying to get done, here's why I need your help, here's why you may think comprehensive immigration reform with a path to citizenship isn't something you care about, but I'm telling you it will help fix the labor market, it will bring people out of the shadows —\n"}, {"entities": {}, "id": "hillary", "text_speach": " — it will actually raise wages. You have to make all those connections so that you've got people with you every step of the way. That's what I want to do.\n"}, {"entities": {}, "id": "hillary", "text_speach": " I never said that.\n"}, {"entities": {"Senator Sanders": {"sent.score": "0.567721", "type": "Person", "sent": "positive", "rel": "0.951834"}, "CLINTON": {"sent.score": 0, "type": "Person", "sent": "neutral", "rel": "0.464264"}}, "id": "hillary", "text_speach": " Look —\n CLINTON: Well, I'm certainly going to unite the party, but I'm not — I'm not getting ahead of myself. I think that would be a little bit presumptuous. If I'm so fortunate as to be the nominee, the first person I will call to talk to about where we go and how we get it done will be Senator Sanders.\n"}, {"entities": {"secretary": {"sent.score": "0.590785", "type": "JobTitle", "sent": "positive", "rel": "0.83585"}}, "id": "sanders", "text_speach": " I agree with what the secretary said. We shouldn't be getting ahead of ourselves. And as I have said many times, you know, sometimes in these campaigns, things get a little bit out of hand. I happen to respect the secretary very much, I hope it's mutual. And on our worst days, I think it is fair to say we are 100 times better than any Republican candidate.\n"}, {"entities": {}, "id": "hillary", "text_speach": " That's true. That's true.\n"}, {"entities": {"MSNBC": {"sent.score": "0.81717", "type": "Company", "sent": "positive", "rel": "0.544521"}, "Senator Sanders": {"sent.score": "0.275592", "type": "Person", "sent": "positive", "rel": "0.774096"}, "New Hampshire": {"sent.score": "0.81717", "type": "StateOrCounty", "sent": "positive", "rel": "0.497824"}}, "id": "hillary", "text_speach": " Well first, thanks to MSNBC and thanks to all of you for holding this debate before the New Hampshire primary. I am going to campaign as hard as I can between now and Tuesday to earn your votes in that primary, and I hear some talk that people are trying to decide do they vote with their heart, do they vote with their head, I'm asking you to bring both your heart and your head to vote with you on Tuesday because we have a lot of work that can only come because your heart is moved.\n So I have been moved by my heart ever since I was a young woman about the age of a lot of Senator Sanders' supporters worrying what I can do to make a difference for my country, and I will bring that heart with me, but I will also tell you we've got to get our heads together to come up with the best answers to solve the problems so that people can have real differences in their lives that will make them better for now and into the future.\n"}, {"entities": {"United States": {"sent.score": "-0.607684", "type": "Country", "sent": "negative", "rel": "0.489488"}, "president": {"sent.score": "-0.244094", "type": "JobTitle", "sent": "negative", "rel": "0.901961"}, "Poland": {"sent.score": "-0.276862", "type": "Country", "sent": "negative", "rel": "0.572494"}, "America": {"sent.score": "-0.607684", "type": "Continent", "sent": "negative", "rel": "0.771189"}}, "id": "sanders", "text_speach": " I — my dad came to this country at the age of 17 from Poland. Didn't have any money, couldn't speak English, he died pretty young, and I think it would have been beyond his wildest dreams to see his son up here on this stage today running for president.\n I love this country and my dad loved this country, and he was the most proud American because of what it gave him in terms of raising his family, even though we never had much money. But today in America, we are the only major country on earth that doesn't guarantee health care to all people, that doesn't guarantee paid family and medical leave. We have the highest rate of childhood poverty of almost any major country on earth. We are seeing millions of families unable to send their kids to college in the United States of America.\n I'm running for president because I believe it is just too late for establishment politics and establishment economics. I do believe we need a political revolution where millions of people stand up and say loudly and clearly that our government belongs to all of us and not just a handful of wealthy campaign contributors.\n Thank you all.\n"}]